# Checkpoint Three: Cleaning Data

Now you are ready to clean your data. Before starting coding, provide the link to your dataset below.
Business Issue: In order to make statistically informed trades, I are looking at the growth of the S&P 500 stocks over the years and what exactly comprises the S&P 500 in terms of composition of various stocks and sectors.We will also attempt to answer the following queries:

--1.Which are the top 5 companies in the S&P 500 based on market capitalisation and EBITDA?

--2.Which sectors does the S&P 500 primarily constitute of and what are the top 10 sectors?

--3.How did the top 5 companies perform over the past 5 years?

My dataset:
https://www.kaggle.com/datasets/andrewmvd/sp-500-stocks
https://www.kaggle.com/datasets/andrewmvd/sp-500-stocks?select=sp500_companies.csv
https://finance.yahoo.com/quote/AMZN/history?p=AMZN
https://finance.yahoo.com/quote/GOOG/history?p=GOOG
https://finance.yahoo.com/quote/MSFT/history?p=MSFT
https://finance.yahoo.com/quote/AAPL/history?p=AAPL
https://finance.yahoo.com/quote/TSLA/history?p=TSLA
https://datahub.io/core/s-and-p-500-companies-financials#resource-s-and-p-500-companies-financials_zip

Import the necessary libraries and create your dataframe(s).

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
df_spc = pd.read_csv('sp500_companies.csv')
df_spi = pd.read_csv('S&P500_index.csv')
Apple = pd.read_csv('AAPL.csv')
Google = pd.read_csv('GOOGL.csv')
Microsoft = pd.read_csv('MSFT.csv')
Tesla = pd.read_csv('TSLA.csv')
Amazon = pd.read_csv('AMZN.csv')

## Missing Data

Test your dataset for missing data and handle it as needed. Make notes in the form of code comments as to your thought process.

In [2]:
df_spc.head()

,Exchange,Symbol,Shortname,Longname,Sector,Industry,Currentprice,Marketcap,Ebitda,Revenuegrowth,City,State,Country,Fulltimeemployees,Longbusinesssummary,Weight
0,NMS,AAPL,Apple Inc.,Apple Inc.,Technology,Consumer Electronics,151.60,2487210213376,1.306340e+11,0.086,Cupertino,CA,United States,154000.0,"Apple Inc. designs, manufactures, and markets ...",0.078540
1,NMS,MSFT,Microsoft Corporation,Microsoft Corporation,Technology,Software—Infrastructure,251.90,1891260039168,9.498300e+10,0.184,Redmond,WA,United States,181000.0,"Microsoft Corporation develops, licenses, and ...",0.059721
2,NMS,TSLA,"Tesla, Inc.","Tesla, Inc.",Consumer Cyclical,Auto Manufacturers,776.58,779888230400,1.270200e+10,0.805,Austin,TX,United States,99290.0,"Tesla, Inc. designs, develops, manufactures, l...",0.024627
3,NYQ,BRK-B,Berkshire Hathaway Inc. New,Berkshire Hathaway Inc.,Financial Services,Insurance—Diversified,285.31,638886084608,1.255810e+11,0.115,Omaha,NE,United States,372000.0,"Berkshire Hathaway Inc., through its subsidiar...",0.020174
4,NYQ,UNH,UnitedHealth Group Incorporated,UnitedHealth Group Incorporated,Healthcare,Healthcare Plans,531.59,500678590464,2.639100e+10,0.142,Minnetonka,MN,United States,350000.0,UnitedHealth Group Incorporated operates as a ...,0.015810

In [3]:
df_spc.isnull().sum()
#Columns with null values(missing data)-
# ebitda=30,
# Revenuegrowth=1,
# state=19,
# Fulltimeemployees=2
#Dropped state column because it is not required for the analysis.
#Replace with actual values for Revenuegrowth and FulLtimeemployees.
#Replace with 'UNKNOWN' for ebitda because I did not find accurate data.

Exchange                0
Symbol                  0
Shortname               0
Longname                0
Sector                  0
Industry                0
Currentprice            0
Marketcap               0
Ebitda                 30
Revenuegrowth           1
City                    0
State                  19
Country                 0
Fulltimeemployees       2
Longbusinesssummary     0
Weight                  0
dtype: int64

In [4]:
df_spc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Exchange             493 non-null    object
 1   Symbol               493 non-null    object
 2   Shortname            493 non-null    object
 3   Longname             493 non-null    object
 4   Sector               493 non-null    object
 5   Industry             493 non-null    object
 6   Currentprice         493 non-null    float64
 7   Marketcap            493 non-null    int64
 8   Ebitda               463 non-null    float64
 9   Revenuegrowth        492 non-null    float64
 10  City                 493 non-null    object
 11  State                474 non-null    object
 12  Country              493 non-null    object
 13  Fulltimeemployees    491 non-null    float64
 14  Longbusinesssummary  493 non-null    object
 15  Weight               493 non-null    float64
dtypes: float64(5), int64(1), object(10)
memory usage: 61.8+ KB

In [47]:
df_spc["Revenuegrowth"].fillna(float(0.113), inplace = True,limit=1)
#df_spc_new[df_spc_new['Revenuegrowth'].isnull()]
# df_spc_new.info()
# df_spc_new.iloc[52]
df_spc[df_spc['Symbol'] == 'CVS']

,Exchange,Symbol,Shortname,Longname,Sector,Industry,Currentprice,Marketcap,Ebitda,Revenuegrowth,City,State,Country,Fulltimeemployees,Longbusinesssummary,Weight
52,NYQ,CVS,CVS Health Corporation,CVS Health Corporation,Healthcare,Healthcare Plans,95.31,125814915072,1.828900e+10,0.113,Woonsocket,RI,United States,216000.0,CVS Health Corporation provides health service...,0.003973

In [48]:
df_spc[df_spc['Fulltimeemployees'].isnull()]
df_spc["Fulltimeemployees"].fillna(float(49000),inplace = True,limit=1)
df_spc[df_spc['Symbol'] == 'MET']

,Exchange,Symbol,Shortname,Longname,Sector,Industry,Currentprice,Marketcap,Ebitda,Revenuegrowth,City,State,Country,Fulltimeemployees,Longbusinesssummary,Weight
144,NYQ,MET,"MetLife, Inc.","MetLife, Inc.",Financial Services,Insurance—Life,61.25,51521048576,9.504000e+09,0.035,New York,NY,United States,49000.0,"MetLife, Inc., a financial services company, p...",0.001627

In [50]:
df_spc[df_spc['Fulltimeemployees'].isnull()]
df_spc["Fulltimeemployees"].fillna(float(9700),inplace = True,limit=1)
df_spc[df_spc['Symbol'] == 'CTXS']
#df_spc_new[df_spc_new['Fulltimeemployees'].isnull()]

,Exchange,Symbol,Shortname,Longname,Sector,Industry,Currentprice,Marketcap,Ebitda,Revenuegrowth,City,State,Country,Fulltimeemployees,Longbusinesssummary,Weight
420,NMS,CTXS,"Citrix Systems, Inc.","Citrix Systems, Inc.",Technology,Software—Application,101.0,12597022720,575734016.0,0.051,Fort Lauderdale,FL,United States,9700.0,"Citrix Systems, Inc., an enterprise software c...",0.000398

In [71]:
df_spc[df_spc['Ebitda'].isnull()]
#All the null values for Ebitda are for financial sector.
#I did not find accurate values,so at present I will replace the null values with'unknown'.
df_spc["Ebitda"].fillna('UNKNOWN',inplace = True)
df_spc[df_spc['Ebitda'].isnull()]
df_spc[df_spc['Symbol'] == 'JPM']

,Exchange,Symbol,Longname,Sector,Industry,Currentprice,Marketcap,Ebitda,Revenuegrowth,Country,Fulltimeemployees,Weight
9,NYQ,JPM,JPMorgan Chase & Co.,Financial Services,Banks—Diversified,113.42,343474307072,UNKNOWN,-0.197,United States,273948.0,0.010846

## Irregular Data

Detect outliers in your dataset and handle them as needed. Use code comments to make notes about your thought process.

In [10]:
df_spc.describe()

,Currentprice,Marketcap,Ebitda,Revenuegrowth,Fulltimeemployees,Weight
count,493.000000,4.930000e+02,4.630000e+02,493.000000,4.910000e+02,493.000000
mean,162.398884,6.423573e+10,6.055417e+09,0.527308,5.540377e+04,0.002028
std,262.710729,1.588148e+11,1.305708e+10,3.833335,1.458281e+05,0.005015
min,8.500000,4.060800e+09,-4.011000e+09,-0.454000,1.050000e+02,0.000128
25%,58.250000,1.599014e+10,1.285896e+09,0.047000,9.514000e+03,0.000505
50%,102.500000,2.882696e+10,2.565300e+09,0.113000,1.930000e+04,0.000910
75%,193.070000,6.070308e+10,5.302000e+09,0.220000,5.315000e+04,0.001917
max,4360.020000,2.487210e+12,1.306340e+11,61.423000,2.300000e+06,0.078540

In [69]:
#Outliers
#df_spc.boxplot(column=['Ebitda'])
# df_spc_new
# df_spc_new.boxplot(column=['Marketcap'])
#df_spc['Ebtida'].hist()
sns.boxplot(df_spc)
#There are some outliers.I would like to keep it for now.

## Unnecessary Data

Look for the different types of unnecessary data in your dataset and address it as needed. Make sure to use code comments to illustrate your thought process.

In [66]:
#Drop data which is not required for the analysis:
df_spc= df_spc.drop(['Shortname','City','State','Longbusinesssummary'],axis = 1)
df_spc.head()
#Following columns will be useful for the analysis for our business issues.

,Exchange,Symbol,Longname,Sector,Industry,Currentprice,Marketcap,Ebitda,Revenuegrowth,Country,Fulltimeemployees,Weight
0,NMS,AAPL,Apple Inc.,Technology,Consumer Electronics,151.60,2487210213376,130633998336.0,0.086,United States,154000.0,0.078540
1,NMS,MSFT,Microsoft Corporation,Technology,Software—Infrastructure,251.90,1891260039168,94982995968.0,0.184,United States,181000.0,0.059721
2,NMS,TSLA,"Tesla, Inc.",Consumer Cyclical,Auto Manufacturers,776.58,779888230400,12702000128.0,0.805,United States,99290.0,0.024627
3,NYQ,BRK-B,Berkshire Hathaway Inc.,Financial Services,Insurance—Diversified,285.31,638886084608,125581000704.0,0.115,United States,372000.0,0.020174
4,NYQ,UNH,UnitedHealth Group Incorporated,Healthcare,Healthcare Plans,531.59,500678590464,26390999040.0,0.142,United States,350000.0,0.015810

In [68]:
#Check for duplicates and remove if any:
df_spc_duplicates = df_spc[df_spc.duplicated()].sum()
df_spc_duplicates
#No duplicates

Exchange             0.0
Symbol               0.0
Longname             0.0
Sector               0.0
Industry             0.0
Currentprice         0.0
Marketcap            0.0
Ebitda               0.0
Revenuegrowth        0.0
Country              0.0
Fulltimeemployees    0.0
Weight               0.0
dtype: float64

## Inconsistent Data

Check for inconsistent data and address any that arises. As always, use code comments to illustrate your thought process.

In [36]:
df_spc.shape
#There are 493 records and 16 columns.
#There should be 503 companies as part of s&p500.I will add missing companies financial constituents.

(493, 16)

## Summarize Your Results

Make note of your answers to the following questions.

1. Did you find all four types of dirty data in your dataset?
Yes, there were dirty data which had missing values and unnecessary data.
2. Did the process of cleaning your data give you new insights into your dataset?
Yes, the data has got clarity after cleaning which gives new insight for the business issues.
3. Is there anything you would like to make note of when it comes to manipulating the data and making visualizations?
While manipulating and visualizing must note and filter the values replaced in the columns especially in 'EBITDA' column.

#Data Manipulation

In [3]:
df_spi.head()

         Date  Close/Last     Open     High      Low
0  10/13/2023     4327.78  4360.49  4377.10  4311.97
1  10/12/2023     4349.61  4380.94  4385.85  4325.43
2  10/11/2023     4376.95  4366.59  4378.64  4345.34
3  10/10/2023     4358.24  4339.75  4385.46  4339.64
4  10/09/2023     4335.66  4289.02  4341.73  4283.79

In [4]:
Apple.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800

In [5]:
Google.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2018-10-15  55.900002  56.090000  54.910999  55.122002  55.122002  30074000
1  2018-10-16  55.674000  56.818501  55.587502  56.653999  56.653999  38378000
2  2018-10-17  57.000000  57.349998  55.700001  56.379501  56.379501  35652000
3  2018-10-18  56.500000  56.617500  54.317001  54.895500  54.895500  46152000
4  2018-10-19  55.185501  56.047501  54.851501  55.258999  55.258999  41286000

In [6]:
Microsoft.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-10-15,108.910004,109.480003,106.949997,107.599998,101.943619,32068100
1,2018-10-16,109.540001,111.410004,108.949997,111.000000,105.164894,31610200
2,2018-10-17,111.680000,111.809998,109.550003,110.709999,104.890152,26548200
3,2018-10-18,110.099998,110.529999,107.830002,108.500000,102.796333,32506200
4,2018-10-19,108.930000,110.860001,108.209999,108.660004,102.947914,32785500

In [7]:
Tesla.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-10-15,17.270666,17.552000,16.969334,17.306000,17.306000,93000000
1,2018-10-16,17.713333,18.492001,17.482668,18.439333,18.439333,142896000
2,2018-10-17,18.826668,18.846666,17.719999,18.118668,18.118668,129832500
3,2018-10-18,17.952667,18.066668,17.533333,17.594000,17.594000,81318000
4,2018-10-19,17.826000,17.977333,16.900000,17.333332,17.333332,140632500

In [8]:
Amazon.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-10-15,89.750000,89.752502,86.711502,88.047501,88.047501,128744000
1,2018-10-16,89.175003,91.194000,88.077499,90.998001,90.998001,117198000
2,2018-10-17,92.139503,92.250000,90.349998,91.586502,91.586502,105904000
3,2018-10-18,91.074501,91.507500,88.393501,88.536003,88.536003,117480000
4,2018-10-19,89.258003,90.455002,87.650002,88.201500,88.201500,118144000

In [9]:
dfs=[Apple,Google,Microsoft,Amazon,Tesla]

In [10]:
for df in dfs:
    df['MA50']=df.Close.rolling(50).mean()
    df['MA200']=df.Close.rolling(200).mean()

In [11]:
Apple.head(200)

,Date,Open,High,Low,Close,Adj Close,Volume,MA50,MA200
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000,NaN,NaN
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000,NaN,NaN
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600,NaN,NaN
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200,NaN,NaN
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800,NaN,NaN
...,...,...,...,...,...,...,...,...,...
195,2019-07-26,51.869999,52.432499,51.785000,51.935001,50.320560,70475600,48.70900,NaN
196,2019-07-29,52.115002,52.660000,52.110001,52.419998,50.790478,86693600,48.80700,NaN
197,2019-07-30,52.189999,52.540001,51.827499,52.195000,50.572479,135742800,48.90590,NaN
198,2019-07-31,54.105000,55.342499,52.825001,53.259998,51.604362,277125600,49.05565,NaN
199,2019-08-01,53.474998,54.507500,51.685001,52.107498,50.487698,216071600,49.16480,46.653663

In [12]:
for df in dfs:
    df['Previous day close Price']=df.Close.shift(1)

In [13]:
Apple.head()

,Date,Open,High,Low,Close,Adj Close,Volume,MA50,MA200,Previous day close Price
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000,NaN,NaN,NaN
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000,NaN,NaN,54.340000
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600,NaN,NaN,55.537498
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200,NaN,NaN,55.297501
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800,NaN,NaN,54.005001

In [15]:
for df in dfs:
    df['Change in Price']=df['Close'] - df['Previous day close Price']

In [16]:
Apple.head()

,Date,Open,High,Low,Close,Adj Close,Volume,MA50,MA200,Previous day close Price,Change in Price
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000,NaN,NaN,NaN,NaN
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000,NaN,NaN,54.340000,1.197498
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600,NaN,NaN,55.537498,-0.239997
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200,NaN,NaN,55.297501,-1.292500
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800,NaN,NaN,54.005001,0.822498

In [18]:
for df in dfs:
    df['Percent change in Price']=df.Close.pct_change()

In [19]:
Apple.head()

,Date,Open,High,Low,Close,Adj Close,Volume,MA50,MA200,Previous day close Price,Change in Price,Percent change in Price
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000,NaN,NaN,NaN,NaN,NaN
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000,NaN,NaN,54.340000,1.197498,0.022037
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600,NaN,NaN,55.537498,-0.239997,-0.004321
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200,NaN,NaN,55.297501,-1.292500,-0.023374
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800,NaN,NaN,54.005001,0.822498,0.015230

In [20]:
for df in dfs:
    df['Previous day Volume']=df.Volume.shift(1)

In [21]:
Apple.head()

,Date,Open,High,Low,Close,Adj Close,Volume,MA50,MA200,Previous day close Price,Change in Price,Percent change in Price,Previous day Volume
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000,NaN,NaN,NaN,NaN,NaN,NaN
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000,NaN,NaN,54.340000,1.197498,0.022037,123164000.0
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600,NaN,NaN,55.537498,-0.239997,-0.004321,116736000.0
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200,NaN,NaN,55.297501,-1.292500,-0.023374,91541600.0
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800,NaN,NaN,54.005001,0.822498,0.015230,130325200.0

In [22]:
for df in dfs:
    df['Change in Volume']=df['Volume']-df['Previous day Volume']

In [23]:
Apple.head()

,Date,Open,High,Low,Close,Adj Close,Volume,MA50,MA200,Previous day close Price,Change in Price,Percent change in Price,Previous day Volume,Change in Volume
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000,NaN,NaN,54.340000,1.197498,0.022037,123164000.0,-6428000.0
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600,NaN,NaN,55.537498,-0.239997,-0.004321,116736000.0,-25194400.0
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200,NaN,NaN,55.297501,-1.292500,-0.023374,91541600.0,38783600.0
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800,NaN,NaN,54.005001,0.822498,0.015230,130325200.0,1989600.0

In [24]:
for df in dfs:
    df['Percent change in Volume']=df.Volume.pct_change()

In [25]:
Apple.head()

,Date,Open,High,Low,Close,Adj Close,Volume,MA50,MA200,Previous day close Price,Change in Price,Percent change in Price,Previous day Volume,Change in Volume,Percent change in Volume
0,2018-10-15,55.290001,55.457500,54.317501,54.340000,52.043247,123164000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018-10-16,54.732498,55.747501,54.189999,55.537498,53.190125,116736000,NaN,NaN,54.340000,1.197498,0.022037,123164000.0,-6428000.0,-0.052191
2,2018-10-17,55.575001,55.660000,54.834999,55.297501,52.960278,91541600,NaN,NaN,55.537498,-0.239997,-0.004321,116736000.0,-25194400.0,-0.215824
3,2018-10-18,54.465000,54.935001,53.250000,54.005001,51.722404,130325200,NaN,NaN,55.297501,-1.292500,-0.023374,91541600.0,38783600.0,0.423672
4,2018-10-19,54.514999,55.314999,54.357498,54.827499,52.510155,132314800,NaN,NaN,54.005001,0.822498,0.015230,130325200.0,1989600.0,0.015266

In [26]:
Apple.to_csv('Apple.csv')
Microsoft.to_csv('Microsoft.csv')
Google.to_csv('Google.csv')
Amazon.to_csv('Amazon.csv')
Tesla.to_csv('Tesla.csv')